Autodesk.Revit.DB.HermiteSplineTangents.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.HermiteSplineTangents.EndTangent
The tangent vector at the end of the curve.
This must be a nomalized unit vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: endTangent has zero length.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The end tangent value is not set.
Since:
2014

Autodesk.Revit.DB.HermiteSplineTangents.StartTangent
The tangent vector at the start of the curve.
This must be a nomalized unit vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: startTangent is not length 1.0.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The start tangent value is not set.
Since:
2014

Autodesk.Revit.DB.HermiteSplineTangents.#ctor
Constructs a new default instance of the class, with tangent vectors uninitialized.
Since:
2014

Autodesk.Revit.DB.HermiteSplineTangents
This class indicates tangency at the start, the end, or both ends of the curve.
Remarks:
Initially, the tangent vectors will not be set, and no tangency condition will be imposed when the
curve is created.
Since:
2014